Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 100)          0                                            
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 100)          2405636     input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 200)          0           input_1[0][0]                    
                                                                 sequential_2[1][0]               
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 1)            413281      concatenate_1[0][0]              
==================================================================================================
Total params: 2,818,917
Trainable params: 2,818,917
Non-trainable params: 0
__________________________________________________________________________________________________
