Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 100)          0                                            
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 100)          13420092    input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 200)          0           input_1[0][0]                    
                                                                 sequential_2[1][0]               
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 1)            1615585     concatenate_1[0][0]              
==================================================================================================
Total params: 15,035,677
Trainable params: 15,035,677
Non-trainable params: 0
__________________________________________________________________________________________________
